[
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Nova Launcher",
    "companyName": "TeslaCoil Apps",
    "id": 101,
    "description": "The highly customizable, performance-driven home screen replacement for Android. It offers unparalleled control over your device's interface, allowing you to change every aspect of your home screen, from icon layouts, grid sizes, and margins to widgets and app drawer styles. Dive into a vast ecosystem of customization with support for thousands of icon packs available on the Play Store. Nova Launcher is optimized for speed, ensuring smooth and snappy animations even on older devices. Unlock its full potential with Nova Launcher Prime to access even more features, such as advanced gesture controls (swipe, pinch, double tap), notification badges with unread counts, the ability to hide apps you don't use, custom icon swipe actions, and more effects. Whether you're a minimalist looking for a clean look or a power user demanding ultimate control, Nova provides the tools to build the perfect, personal home screen experience. It's not just a launcher; it's a way to make your phone truly yours, blending aesthetic freedom with practical, performance-focused enhancements that improve your daily interaction with your technology. It also includes robust backup and restore functionality, making it easy to save your perfect setup or transfer it to a new device. It is constantly updated with new features and optimizations, maintaining its status as a top-tier choice for Android enthusiasts.",
    "size": 15.2,
    "reviews": 1450230,
    "ratingAvg": 4.6,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 45010 },
      { "name": "2 star", "count": 28900 },
      { "name": "3 star", "count": 86320 },
      { "name": "4 star", "count": 290000 },
      { "name": "5 star", "count": 1000000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "SwiftKey Keyboard",
    "companyName": "Microsoft",
    "id": 102,
    "description": "An intelligent keyboard that learns your writing style, so you can type faster. This keyboard uses advanced artificial intelligence to learn your unique vocabulary, slang, and emoji preferences, providing incredibly accurate autocorrect and next-word predictions that adapt to you. Say goodbye to frustrating typos and hello to effortless communication. SwiftKey's prediction engine gets smarter over time, making typing feel less like work and more like an extension of your thoughts. It also features a robust GIF, sticker, and emoji search engine built right in, so you can find the perfect reaction without switching apps. Customize your typing experience with hundreds of free themes, or design your own. SwiftKey supports over 500 languages and allows you to type in up to five languages simultaneously without changing settings. Its 'Flow' feature lets you type by gliding your finger across the keyboard. All your learned language data securely syncs across your devices with your Microsoft account, ensuring your personal dictionary is always with you. It also includes features like a clipboard, calendar access, and translation, making it a comprehensive typing tool. It's the keyboard that truly understands you.",
    "size": 45.5,
    "reviews": 3200000,
    "ratingAvg": 4.3,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 210000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 350000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 1790000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Pocket Casts",
    "companyName": "Automattic",
    "id": 103,
    "description": "The world's most powerful podcast platform, an app by listeners, for listeners. Designed for podcast enthusiasts, it provides a seamless listening, search, and discovery experience. Find your next obsession with curated recommendations and powerful search tools that even let you search within episode show notes. Take control of your listening with advanced playback features, including variable playback speed (from 0.5x to 3x), a 'Trim Silence' option to dynamically shorten pauses, and a 'Volume Boost' to enhance voice clarity. Build a perfect playback queue and use powerful filters to organize your shows. Pocket Casts syncs your listening progress, subscriptions, and custom filters across all your devices (Android, iOS, web, and desktop), so you can pick up right where you left off, no matter where you are. Download episodes for offline listening, set up auto-downloads for your favorite shows, and manage your storage effectively. It also offers beautiful light and dark themes, extensive customization, and support for Apple Watch, CarPlay, and Android Auto, making it the definitive podcast experience for anyone who truly loves the medium. The discovery tools are second to none, helping you find niche content easily.",
    "size": 25.8,
    "reviews": 155780,
    "ratingAvg": 4.7,
    "downloads": 1000000,
    "ratings": [
      { "name": "1 star", "count": 3100 },
      { "name": "2 star", "count": 1980 },
      { "name": "3 star", "count": 5700 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 115000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Solid Explorer",
    "companyName": "NeatBytes",
    "id": 104,
    "description": "A powerful file manager with a sleek design and intuitive user interface. This app stands out with its Material Design aesthetics and a unique two-pane interface, which allows you to navigate two different folders simultaneously and easily drag-and-drop files between them. It provides robust management for your device's internal storage and SD card, but its power extends far beyond local files. Solid Explorer seamlessly connects to all your favorite cloud storage providers, including Google Drive, Dropbox, OneDrive, and Mega, as well as network protocols like FTP, SFTP, WebDav, and SMB/CIFS, letting you manage all your files from one central hub. For advanced users, it offers root access to browse system files. It also supports major archive formats like ZIP, 7ZIP, RAR, and TAR, allowing you to create and extract files with ease. Protect your sensitive data with strong AES encryption for files and folders, secured by a password or fingerprint. The app is highly customizable with various icon sets, color schemes, and themes. Additional functionality can be added via plugins, such as a dedicated USB OTG plugin or a cast plugin. It's the ultimate tool for managing your digital life.",
    "size": 18.0,
    "reviews": 210500,
    "ratingAvg": 4.5,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 8000 },
      { "name": "2 star", "count": 5500 },
      { "name": "3 star", "count": 12000 },
      { "name": "4 star", "count": 45000 },
      { "name": "5 star", "count": 140000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "1Password",
    "companyName": "AgileBits",
    "id": 105,
    "description": "The password manager that's as beautiful and simple as it is secure. It goes beyond simple password storage, providing a secure vault for all your sensitive information, including credit cards, secure notes, bank accounts, and software licenses. 1Password remembers everything for you, generating strong, unique passwords for every site and automatically filling them in with a single click or tap. Its seamless integration with all major browsers and operating systems (Windows, macOS, iOS, Android, and Linux) ensures your data is always in sync and accessible wherever you need it. The app's 'Watchtower' feature actively monitors your logins for security breaches, weak or reused passwords, and sites that support two-factor authentication, helping you keep your digital identity safe. You can also store your 2FA one-time passcodes directly within 1Password, simplifying your login process. Share vaults securely with family members or team colleagues, controlling who has access to what. With industry-leading end-to-end encryption, your data is only ever decrypted locally on your device, meaning only you can access it. It's the ultimate solution for digital security and peace of mind in an online world.",
    "size": 55.3,
    "reviews": 95000,
    "ratingAvg": 4.8,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 1200 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 11000 },
      { "name": "5 star", "count": 80000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Todoist",
    "companyName": "Doist Inc.",
    "id": 106,
    "description": "Trusted by millions, Todoist is the best online to-do list and task manager. It helps you organize both your work and personal life with powerful yet simple features. Capture and organize tasks the moment they pop into your head using natural language input—just type 'Water plants every Friday' and Todoist will automatically set a recurring task. Break down big projects into manageable sub-tasks and use sections to group them. Prioritize your day with priority levels and see your tasks in a clear, customizable view. Collaborate with others by sharing projects, assigning tasks, and adding comments, keeping everyone on the same page. Use labels and powerful filters to create custom views that match your workflow, whether you're following the GTD (Getting Things Done) methodology or your own system. Todoist integrates with all your favorite tools, including Google Calendar, Dropbox, Slack, and hundreds more, making it the central hub for your productivity. With cross-platform sync across all your devices, your to-do list is always with you. Visualize your progress with productivity trends and Karma points, turning task management into a motivating experience to help you achieve your goals.",
    "size": 30.1,
    "reviews": 350400,
    "ratingAvg": 4.6,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 10200 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 22200 },
      { "name": "4 star", "count": 70000 },
      { "name": "5 star", "count": 240000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Canva",
    "companyName": "Canva",
    "id": 107,
    "description": "Design anything. Publish anywhere. The ultimate tool for graphic design. Canva makes graphic design accessible to everyone, regardless of their skill level. Whether you need to create stunning Instagram stories, professional presentations, eye-catching logos, event invitations, or YouTube thumbnails, Canva has you covered with thousands of professionally designed, customizable templates. Its intuitive drag-and-drop editor simplifies the design process, allowing you to easily add, edit, and arrange text, elements, and images. Access a vast library of millions of stock photos, videos, audio tracks, and graphic elements to bring your vision to life. Collaborate in real-time with your team by sharing designs and leaving comments. With Canva Pro, you can unlock even more powerful features, such as the Brand Kit, which stores your brand's logos, colors, and fonts for consistent branding across all designs. The Magic Resize tool instantly adapts your design to fit any social media format, and the background remover cleans up photos with a single click. From social media managers to small business owners and students, Canva empowers you to produce beautiful, high-quality visual content quickly and efficiently, all from your phone or desktop.",
    "size": 28.9,
    "reviews": 8500000,
    "ratingAvg": 4.7,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 260000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 7000000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Notion",
    "companyName": "Notion Labs, Inc.",
    "id": 108,
    "description": "The all-in-one workspace for your notes, tasks, wikis, and databases. It provides a flexible and powerful set of tools that adapt to your specific needs. Think of it as a set of building blocks: you can create simple notes, complex project management systems, company-wide wikis, or personal habit trackers, all within one unified space. The true power of Notion lies in its interconnected databases. Create a database of tasks and view it as a list, a Kanban board, a calendar, or a gallery. Link databases together to create powerful relational workflows, like connecting a 'Projects' database to a 'Tasks' database. Start from a blank page or use one of the thousands of templates created by Notion and its vibrant community. Collaborate in real-time with your team, mentioning colleagues, assigning tasks, and leaving comments directly on any block of content. Embed content from over 500 other apps, including Google Drive, Figma, Slack, and GitHub, making Notion your central source of truth. It's the perfect tool for knowledge management, project tracking, and personal organization, replacing multiple scattered apps with one cohesive solution for teams and individuals.",
    "size": 12.4,
    "reviews": 230000,
    "ratingAvg": 4.4,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 11000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 21000 },
      { "name": "4 star", "count": 50000 },
      { "name": "5 star", "count": 140000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Shazam",
    "companyName": "Apple Inc.",
    "id": 109,
    "description": "Discover, identify, and explore the music you love in seconds. Ever heard a song in a cafe, on the radio, or in a movie and desperately needed to know what it was? Shazam is the magic app that listens to the music playing around you and instantly identifies the track and artist. But it doesn't stop at identification. Once a song is Shazamed, you get access to a wealth of information, including real-time, synced lyrics so you can sing along, the artist's biography, and recommended tracks. Connect your Spotify or Apple Music account to instantly add your discovered songs to your playlists and listen to them in full. The 'Auto Shazam' feature can run in the background, continuously identifying music and TV shows even when you leave the app. It even works offline by saving a digital fingerprint of the audio and matching it when you're back online. Use 'Pop-Up Shazam' to identify music playing in any app on your phone, like TikTok, Instagram, or YouTube. See what's trending in your city or around the world with Shazam's real-time charts. It's the essential companion for every music lover and a gateway to new musical discoveries.",
    "size": 9.8,
    "reviews": 7200000,
    "ratingAvg": 4.8,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 120000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 6000000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Strava",
    "companyName": "Strava Inc.",
    "id": 110,
    "description": "Track your fitness activity with Strava. Record your run, map a cycling route & analyze your training. It's more than just a tracker; it's the social network for athletes. Whether you're a runner, cyclist, swimmer, or hiker, Strava turns your phone into a sophisticated performance computer. Record your activity and get key stats like distance, pace, speed, elevation gained, and calories burned. But the real magic happens when you connect with the community. Compete on 'segments'—specific stretches of road or trail—and see how you stack up against your friends, local legends, and even pros on the leaderboards. Give and receive 'kudos' for great efforts and share photos and stories from your activities. The app's powerful route planning tools let you discover new places to explore, with recommendations powered by the millions of activities uploaded by the Strava community. Analyze your performance in-depth, track your fitness over time, and set new personal records. With a subscription, you can unlock advanced features like Beacon, which shares your real-time location with loved ones for safety, personalized training plans, and deeper performance analysis, including heart rate data and power meter breakdowns.",
    "size": 75.0,
    "reviews": 1100000,
    "ratingAvg": 4.5,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 700000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Duolingo",
    "companyName": "Duolingo",
    "id": 111,
    "description": "Learn a new language for free. Fun, effective, and 100% free. This app revolutionizes language learning by turning it into a game. Whether you want to learn Spanish, French, Japanese, or one of over 40 other languages, Duolingo makes it engaging and motivating. The app is built on the idea that short, bite-sized lessons are more effective for forming a consistent habit. Each lesson feels like a game, where you earn points for correct answers, race against the clock, and level up. Maintain your 'streak' by practicing every day and compete with friends and other learners on global leaderboards. The methodology is science-based, designed to help you learn and retain information effectively. You'll practice all aspects of language: reading, writing, listening, and speaking, with exercises voiced by native speakers and AI-powered conversation practice. Duolingo's 'Stories' feature provides fun, short narratives to help you improve your reading and listening comprehension in context. The app's design is friendly and encouraging, making it perfect for beginners and those looking to refresh their skills. It's the most popular language-learning platform in the world for a reason, making education accessible to all.",
    "size": 35.6,
    "reviews": 15000000,
    "ratingAvg": 4.7,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 550000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 12000000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Headspace",
    "companyName": "Headspace Inc.",
    "id": 112,
    "description": "Meditation and sleep made simple. Live a healthier, happier, more well-rested life. Headspace is your personal guide to mindfulness in your everyday life. Learn to meditate and live more mindfully with guided sessions on everything from stress and anxiety management to focus, productivity, and personal growth. Start with the 'Basics' course, a simple 10-day introductory series that teaches you the fundamentals of meditation and mindfulness. The app's extensive library includes hundreds of guided meditations, mini-meditations for a quick mental reset, and SOS sessions for moments of high stress. Improve your rest with 'Sleepcasts,' which are audio-driven, dreamy landscapes to help you drift off. You can also explore sleep music and relaxation sounds. Start your day on a positive note with 'The Wake Up,' a daily video series designed to inspire and educate. For fitness, 'Move Mode' offers guided mindfulness exercises for running, walking, and home workouts, led by professional trainers. The app's clean, playful, and easy-to-navigate interface makes mindfulness accessible to everyone, helping you build a lasting practice to reduce stress, improve focus, and sleep better. It's like a gym membership for your mind.",
    "size": 42.1,
    "reviews": 780000,
    "ratingAvg": 4.9,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 12000 },
      { "name": "4 star", "count": 60000 },
      { "name": "5 star", "count": 700000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "TickTick",
    "companyName": "Appest Inc.",
    "id": 113,
    "description": "A simple and effective to-do list and task manager app which helps you make schedule. It's a powerful productivity tool that combines your to-do list, reminders, calendar, and habit tracker all in one place. Capture ideas and tasks effortlessly with its intuitive interface and smart date parsing. Organize your life into lists, folders, and tags. Break down complex tasks into manageable sub-tasks with checklists. TickTick's integrated calendar view allows you to see all your tasks and events in one place, making scheduling a breeze. It also features a built-in Pomodoro Timer to help you stay focused and productive, as well as a robust Habit Tracker to help you build good habits like meditation or reading. Set flexible and recurring reminders so you never miss a deadline. Collaborate with family, friends, or colleagues by sharing lists and assigning tasks. The app syncs seamlessly across all your devices, including Android, iOS, Windows, Mac, and web, so your schedule is always up-to-date. With customizable themes, priority levels, and multiple calendar views, TickTick provides the flexibility to create a productivity system that works perfectly for you and helps you get things done.",
    "size": 22.7,
    "reviews": 165000,
    "ratingAvg": 4.7,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 130000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "InShot",
    "companyName": "InShot Inc.",
    "id": 114,
    "description": "A powerful all-in-one Video Editor and Video Maker with professional features. InShot is the perfect tool for creating engaging content for social media like TikTok, Instagram Reels, and YouTube. It packs professional-grade features into a user-friendly mobile interface. Easily trim, cut, split, and merge video clips. Adjust the speed of your footage for slow-motion or fast-motion effects. Add your own music, browse InShot's extensive library of free vlog music and sound effects, or even extract audio from other videos. Make your videos stand out by adding animated text, stickers, emojis, and custom photos. Apply stunning filters and effects to change the mood of your video. InShot also excels as a photo editor, allowing you to add filters, text, and backgrounds to your images, or create beautiful collages. It supports all popular aspect ratios, making it simple to format your video perfectly for any platform. You can adjust the canvas, add colored or blurred backgrounds, and export your creations in high definition (up to 4K) without a watermark (in the Pro version). It's the ideal editor for content creators, vloggers, and anyone looking to make polished videos on the go.",
    "size": 60.3,
    "reviews": 12000000,
    "ratingAvg": 4.8,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 250000 },
      { "name": "4 star", "count": 1600000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Bitwarden",
    "companyName": "Bitwarden Inc.",
    "id": 115,
    "description": "An open-source password manager offering the easiest and safest way to store logins. As a fully open-source solution, Bitwarden offers unparalleled transparency and security, allowing its code to be audited by security experts worldwide. It provides a secure vault to store all your passwords, secure notes, credit card information, and identities. Access your data from anywhere with seamless synchronization across all your devices, including desktop applications for Windows, macOS, and Linux, browser extensions for all major browsers, and mobile apps. Bitwarden uses end-to-end AES-256 bit encryption, meaning your data is fully encrypted before it ever leaves your device, and only you have the key to unlock it. The app includes a powerful password generator to create strong, unique passwords for every account. Its autofill feature makes logging into websites and apps effortless and secure. The free version offers unlimited password storage across unlimited devices, which is a feature many competitors charge for. Upgrade to a premium account to unlock advanced features like emergency access, two-factor authentication options (like YubiKey), encrypted file storage, and security reports that identify weak or reused passwords. It's security you can trust.",
    "size": 38.5,
    "reviews": 98000,
    "ratingAvg": 4.7,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 1500 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 80000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "VLC for Android",
    "companyName": "VideoLAN",
    "id": 116,
    "description": "VLC media player is a free and open source cross-platform multimedia player that plays most multimedia files. This app is the mobile version of the famous desktop player, known for its ability to play virtually any video or audio file format you throw at it, without the need for additional codecs. It handles everything from MKV, MP4, AVI, and MOV to audio formats like FLAC, MP3, and AAC. VLC features a full media library for audio and video files, allowing you to browse folders directly. It supports network streaming, including HLS, and can play network shares (like SMB or FTP) and ISO files. The player includes advanced subtitle support, with the ability to download subtitles, adjust their timing, and customize their appearance. For audiophiles, VLC provides a full-featured 10-band equalizer and various audio filters. It supports multi-track audio and subtitles, aspect-ratio adjustments, and gesture controls for volume, brightness, and seeking. Best of all, VLC for Android is completely free, open-source, and contains no ads, no in-app purchases, and no tracking. It is the definitive, no-nonsense media player for users who demand compatibility and control over their media playback.",
    "size": 32.0,
    "reviews": 1800000,
    "ratingAvg": 4.4,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 60000 },
      { "name": "3 star", "count": 140000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 1100000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Google Keep",
    "companyName": "Google LLC",
    "id": 117,
    "description": "Quickly capture what's on your mind and get a reminder later at the right place or time. It's the digital equivalent of a stack of sticky notes, but far more powerful and organized. Create notes, checklists, drawings, or voice memos—which Keep will automatically transcribe for you. Organize your thoughts visually by color-coding your notes or adding labels, making it easy to find what you need later. The app's powerful search function can even find text within images you've saved. Set time-based or location-based reminders; for example, ask Keep to remind you to buy groceries when you arrive at the store. Share your notes and lists with others and collaborate in real-time. Watch as checklists get ticked off by your housemate or family member. Google Keep integrates seamlessly across all your devices (phone, tablet, web, and Wear OS), and it's also accessible directly from Gmail and Google Docs, allowing you to drag and drop your notes into your emails or documents. It’s the perfect, simple tool for quick thoughts, brainstorming, shopping lists, and capturing inspiration whenever it strikes, ensuring you never let a great idea slip away.",
    "size": 11.5,
    "reviews": 2500000,
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 250000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "AccuWeather",
    "companyName": "AccuWeather",
    "id": 118,
    "description": "Get live weather forecasts, storm alerts, and more with AccuWeather's superior accuracy. Stay one step ahead of the weather with forecasts you can rely on. AccuWeather provides detailed hourly, daily, and 15-day forecasts, giving you all the information you need to plan your day. The app's standout feature is the patented 'MinuteCast,' which provides minute-by-minute precipitation forecasts for your exact location for the next two hours, so you know precisely when the rain or snow will start and stop. Get a more accurate sense of how the weather actually feels with the 'RealFeel' temperature, which takes into account factors like wind, humidity, and cloud cover. Track storms in real-time with the advanced weather radar maps. Receive severe weather alerts directly on your phone for events like high winds, heavy rain, or snow. The app also provides valuable health-related information, such as the Air Quality Index (AQI), allergy outlooks, and UV index. With customizable widgets, a clean interface, and in-depth weather news and videos, AccuWeather provides a comprehensive and superior weather experience to keep you safe and informed about your local and global conditions.",
    "size": 85.2,
    "reviews": 3500000,
    "ratingAvg": 4.2,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 1700000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 119,
    "description": "Talk, chat, hang out, and stay close with your friends and communities. Originally built for gamers, Discord has evolved into a powerful communication platform for everyone. Create a 'server,' which is an invite-only home for your communities and friend groups. Within each server, you can organize discussions into topic-based text 'channels' for sharing messages, images, and files, or jump into 'voice channels' for high-quality, low-latency voice chat. Hang out with friends in a voice channel while playing games, or use it for a study group session. Discord also supports high-quality video chat and screen sharing, making it perfect for everything from collaborative work to watching movies together. The robust roles and permissions system allows server owners to manage their communities effectively, granting different levels of access and moderation tools. With its 'Go Live' feature, you can stream your gameplay or application window to a small group. Whether you're part of a school club, a gaming clan, an art community, or just a group of friends, Discord provides a reliable and fun way to communicate and spend time together, all in one place.",
    "size": 90.7,
    "reviews": 5500000,
    "ratingAvg": 4.5,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 350000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 3700000 }
    ]
  },
  {
    "image": "https://www.apple.com/v/app-store/c/images/overview/icon_appstore__ev0z770zyxoy_medium.png",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 120,
    "description": "Dive into anything. Reddit is a network of communities where people can find experiences built around their interests. It is home to thousands of 'subreddits,' which are individual communities dedicated to every topic imaginable. Whether your interest is in breaking news, technology, finance, fitness, cooking, niche hobbies, or just looking at cute animal pictures, there is a subreddit for you. Content is curated by the users themselves through a system of 'upvotes' and 'downvotes.' The most interesting and relevant posts and comments rise to the top, while less valuable content sinks. Users earn 'karma' for their contributions, creating a system of reputation within the platform. You can join conversations, share your own content (text posts, links, images, and videos), or simply lurk and absorb information. Reddit is known for its pseudo-anonymous nature, allowing users to speak freely and engage in deep discussions. It's the place to find answers to specific questions, get support from like-minded individuals, or just pass the time by browsing an endless feed of content tailored to your subscriptions. It's often called 'the front page of the internet' for its ability to surface viral content.",
    "size": 58.1,
    "reviews": 4200000,
    "ratingAvg": 3.8,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 2100000 }
    ]
  }
]